In [2]:
import pandas as pd

## 예제 3-1  시리즈와 데이터프레임 내의 속성 확인 및 리스트 변환

In [3]:
op = pd.read_csv('../data/series_dataframe.csv')

In [4]:
op.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [5]:
op.shape

(264, 3)

In [6]:
(op['Series'] == op['DataFrame']).head()

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [7]:
op_eq = op.loc[(op['Series'] == op['DataFrame'])]

In [8]:
op_eq.shape

(190, 3)

In [9]:
op_eq.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [10]:
op_eq.tail()

     Member  Series DataFrame
256  update  update    update
259  values  values    values
260     var     var       var
262   where   where     where
263      xs      xs        xs

In [11]:
op_eq_list = op_eq['Member'].tolist()

In [12]:
op_eq_list

['T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'clip',
 'clip_lower',
 'clip_upper',
 'combine',
 'combine_first',
 'compound',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_csv',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_copy',
 'isin',
 'isna',
 'isnull',
 'ix',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select',
 'sem',
 'set_axis',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sortlevel',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_period',
 'to_pickle',
 'to_sparse',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

## 예제 3-2  연산자와 메소드 계산

In [13]:
college = pd.read_csv('../data/2017_college_tuition.csv',encoding='euc-kr')

In [14]:
college.shape

(196, 3)

In [15]:
college.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [16]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

In [17]:
college['평균등록금'] = college['평균등록금'] * 1000

In [18]:
college.head()

         학교명 설립구분    평균등록금
0    강릉원주대학교  국공립  4262000
1      강원대학교  국공립  4116000
2  경남과학기술대학교  국공립  3771000
3      경북대학교  국공립  4351000
4      경상대학교  국공립  3967000

In [19]:
(college['평균등록금'] + college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [20]:
college['평균등록금'].add(college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [21]:
college['평균등록금'].add(college['평균등록금']).head()

0    8524000
1    8232000
2    7542000
3    8702000
4    7934000
Name: 평균등록금, dtype: int64

In [22]:
help(college['평균등록금'].add)

Help on method add in module pandas.core.ops:

add(other, level=None, fill_value=None, axis=0) method of pandas.core.series.Series instance
    Return Addition of series and other, element-wise (binary operator `add`).

    Equivalent to ``series + other``, but with support to substitute a fill_value for
    missing data in either one of the inputs.

    Parameters
    ----------
    other : Series or scalar value
    fill_value : None or float value, default None (NaN)
        Fill existing missing (NaN) values, and any new element needed for
        successful Series alignment, with this value before computation.
        If data in both corresponding Series locations is missing
        the result of filling (at that location) will be missing.
    level : int or name
        Broadcast across a level, matching Index values on the
        passed MultiIndex level.

    Returns
    -------
    Series
        The result of the operation.

    See Also
    --------
    Series.radd : Reverse of the Addition operator, see
        `Python documentation
        <https://docs.python.org/3/reference/datamodel.html#emulating-numeric-types>`_
        for more details.

    Examples
    --------
    >>> a = pd.Series([1, 1, 1, np.nan], index=['a', 'b', 'c', 'd'])
    >>> a
    a    1.0
    b    1.0
    c    1.0
    d    NaN
    dtype: float64
    >>> b = pd.Series([1, np.nan, 1, np.nan], index=['a', 'b', 'd', 'e'])
    >>> b
    a    1.0
    b    NaN
    d    1.0
    e    NaN
    dtype: float64
    >>> a.add(b, fill_value=0)
    a    2.0
    b    1.0
    c    1.0
    d    1.0
    e    NaN
    dtype: float64

## 예제 3-3  특정 자료형을 가지고 열을 구분하기

In [23]:
college.head(2)

       학교명 설립구분    평균등록금
0  강릉원주대학교  국공립  4262000
1    강원대학교  국공립  4116000

In [24]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

In [25]:
college.select_dtypes(include=['int64']).head()

     평균등록금
0  4262000
1  4116000
2  3771000
3  4351000
4  3967000

In [26]:
# 숫자자료형인 number로도 구분 가능

In [27]:
college.select_dtypes(include=['number']).head()

     평균등록금
0  4262000
1  4116000
2  3771000
3  4351000
4  3967000

In [28]:
college.select_dtypes(include=['object']).head()

         학교명 설립구분
0    강릉원주대학교  국공립
1      강원대학교  국공립
2  경남과학기술대학교  국공립
3      경북대학교  국공립
4      경상대학교  국공립

## 예제 3-4 시리즈 내의 자료값 확인하기

In [29]:
college.head()

         학교명 설립구분    평균등록금
0    강릉원주대학교  국공립  4262000
1      강원대학교  국공립  4116000
2  경남과학기술대학교  국공립  3771000
3      경북대학교  국공립  4351000
4      경상대학교  국공립  3967000

In [30]:
college['평균등록금'].value_counts().head()

3424000    2
7161000    2
4262000    1
5967000    1
7913000    1
Name: 평균등록금, dtype: int64

In [31]:
# normalize=True 인자를 넣어주면 퍼센트(빈도)로 반환

In [32]:
college['평균등록금'].value_counts(normalize=True).head()

3424000    0.010204
7161000    0.010204
4262000    0.005102
5967000    0.005102
7913000    0.005102
Name: 평균등록금, dtype: float64

In [33]:
college['설립구분'].value_counts().head()

사립     156
국공립     40
Name: 설립구분, dtype: int64

In [34]:
college['설립구분'].head()

0    국공립
1    국공립
2    국공립
3    국공립
4    국공립
Name: 설립구분, dtype: object

In [35]:
# duplicated 함수를 사용하면 중복되는 값부터 True로 반환

In [36]:
college['설립구분'].duplicated().head()

0    False
1     True
2     True
3     True
4     True
Name: 설립구분, dtype: bool

In [37]:
college['설립구분'].unique()

array(['국공립', '사립'], dtype=object)

## 예제 3-5 내부 구성 값이 크기 비교

In [38]:
college['평균등록금'].nlargest(5)

173    9004000
132    8824000
128    8649000
147    8526000
146    8499000
Name: 평균등록금, dtype: int64

In [39]:
college['평균등록금'].nsmallest(5)

61           0
157    1760000
137    2000000
20     2390000
15     3024000
Name: 평균등록금, dtype: int64

In [40]:
college.nlargest(5,'평균등록금')

           학교명 설립구분    평균등록금
173  한국산업기술대학교   사립  9004000
132      연세대학교   사립  8824000
128      신한대학교   사립  8649000
147    이화여자대학교   사립  8526000
146      을지대학교   사립  8499000

In [41]:
college.nsmallest(5,'평균등록금')

          학교명 설립구분    평균등록금
61   광주가톨릭대학교   사립        0
157   중앙승가대학교   사립  1760000
137   영산선학대학교   사립  2000000
20    서울시립대학교  국공립  2390000
15    부산교육대학교  국공립  3024000

## 예제 3-6/7 시리즈만 가지는 메소드

In [42]:
op = pd.read_csv('../data/series_dataframe.csv')

In [43]:
op_not = op.loc[(op['Series'] != op['DataFrame'])]

In [44]:
op_not.head()

      Member    Series DataFrame
12  applymap       NaN  applymap
13    argmax    argmax       NaN
14    argmin    argmin       NaN
15   argsort   argsort       NaN
19  asobject  asobject       NaN

In [45]:
op_not.shape

(74, 3)

In [46]:
op_ser = op_not['Series'].dropna()

In [47]:
op_ser_list = op_ser.tolist()

In [48]:
count = 0
for i in op_ser_list :     
    try :
        
        if type(pd.Series.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
            if count % 5 == 0 :
                print()
    except Exception as e :
        pass

In [49]:
import seaborn as sns

In [50]:
iris = sns.load_dataset('iris')

In [51]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [52]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

## 예제 3-8 인덱스 변경 및 대체

In [53]:
s = pd.Series([1,2,3,4])

In [54]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [55]:
s_re = s.rename({0:'a',1:'b',2:'c',3:'d'})

In [56]:
s_re

a    1
b    2
c    3
d    4
dtype: int64

In [57]:
# reindex에 지정되지 않은 행 인덱스의 값은 NaN으로 표기

In [58]:
s_re.reindex(['a','b','c','e'])

a    1.0
b    2.0
c    3.0
e    NaN
dtype: float64

In [59]:
# reindex에 지정된 행만 필터링
s_re.reindex(['a','b','c'])

a    1
b    2
c    3
dtype: int64

In [60]:
# reindex로 지정된 행 인덱스 순서로 정렬
s_re.reindex(['c','b','a'])

c    3
b    2
a    1
dtype: int64

In [61]:
s1 = pd.Series([10,20,30], index=[0,1,2])

In [62]:
s1

0    10
1    20
2    30
dtype: int64

In [63]:
s1.index.dtype

dtype('int64')

In [64]:
s2 = pd.Series([1,2,3], index=list('012'))

In [65]:
s2

0    1
1    2
2    3
dtype: int64

In [66]:
s2.index.dtype

dtype('O')

In [67]:
# s1, s2의 인덱스 타입이 맞지 않아 정상적인 연산 불가

In [68]:
s1 + s2

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [69]:
s2.index = [0,1,2]

In [70]:
s1 + s2

0    11
1    22
2    33
dtype: int64

In [82]:
s3 = pd.Series([11,12,13], index=list('012'))

In [84]:
s3

0    11
1    12
2    13
dtype: int64

In [83]:
s3.index

Index(['0', '1', '2'], dtype='object')

In [85]:
# 인덱스를 rename함수를 통하여 정수로 변경
s3 = s3.rename({'0':0, '1':1,'2':2})

In [73]:
s1

0    10
1    20
2    30
dtype: int64

In [75]:
s3

0    11
1    12
2    13
dtype: int64

In [80]:
s1 + s3

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [71]:
s4 = pd.Series([11,12,13], index=list('012'))

In [72]:
s4.index.values

array(['0', '1', '2'], dtype=object)

In [73]:
s4.index = s4.index.values.astype('int64')

In [74]:
s1 + s4

0    21
1    32
2    43
dtype: int64